# YOLOv5-L with PP-LCNet backbone (3-out)

nc: 1
depth_multiple: 1.0
width_multiple: 1.0

anchors:
  - [10, 13, 16, 30, 33, 23]
  - [30, 61, 62, 45, 59, 119]
  - [116, 90, 156, 198, 373, 326]

# PP_LCNet 输出三层 (C3,C4,C5) ≈ [64,160,320] @ strides 8/16/32

backbone: [
  [-1, 1, PP_LCNet, [1.0, [2, 3, 4]]],  # 0: 输出 list=[C3,C4,C5]
  [ 0, 1, IndexSelect, [0]],             # 1: C3 (s=8)
  [ 0, 1, IndexSelect, [1]],             # 2: C4 (s=16)
  [ 0, 1, IndexSelect, [2]],             # 3: C5 (s=32)
]

head: [
  [ 3, 1, SPPF, [256, 5]],                     # 4: 320->256
  [ 4, 1, nn.Upsample, [None, 2, 'nearest']],  # 5
  [[5, 2], 1, Concat, [1]],                    # 6
  [ 6, 3, C3, [256, False]],                   # 7

  [ 7, 1, nn.Upsample, [None, 2, 'nearest']],  # 8
  [[8, 1], 1, Concat, [1]],                    # 9
  [ 9, 3, C3, [128, False]],                   # 10 (P3)

  [10, 1, Conv, [256, 3, 2]],                  # 11  ✅
  [[11, 7], 1, Concat, [1]],                   # 12
  [12, 3, C3, [256, False]],                   # 13 (P4)

  [13, 1, Conv, [256, 3, 2]],                  # 14  ✅
  [[14, 4], 1, Concat, [1]],                   # 15
  [15, 3, C3, [256, False]],                   # 16 (P5)

  [[10, 13, 16], 1, Detect, [nc, anchors]],    # 17
]

