# YOLOv5-L with LCNet backbone (no TA)

nc: 1
depth_multiple: 1.0
width_multiple: 1.0

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]

# ========== Backbone ==========
backbone:
  # 0: LCNet 输出 [P3, P4, P5]，通道约 [64, 160, 320]
  - [-1, 1, PP_LCNet, [1.0, [1,2,3], 'hswish']]

  # 1/2/3: 取出 P3/P4/P5
  - [0, 1, IndexSelect, [0]]    # P3 (80x80)
  - [0, 1, IndexSelect, [1]]    # P4 (40x40)
  - [0, 1, IndexSelect, [2]]    # P5 (20x20)

  # 4: P5 -> SPPF（与图一致，仍在“骨干盒子”里即可）
  - [3, 1, SPPF, [320, 5]]      # 若想更强，可把 320 提到 512/640

# ========== Neck + Head ==========
head:
  # P5(SPPF) 与 P4 融合
  - [4, 1, Conv, [256, 1, 1]]               # 5
  - [2, 1, Conv, [256, 1, 1]]               # 6
  - [5, 1, nn.Upsample, [None, 2, 'nearest']]# 7
  - [[7, 6], 1, Concat, [1]]                # 8
  - [8, 3, C3, [256, False]]                # 9  (P4_top)

  # 与 P3 融合
  - [9, 1, Conv, [128, 1, 1]]               # 10
  - [10, 1, nn.Upsample, [None, 2, 'nearest']]# 11
  - [1, 1, Conv, [128, 1, 1]]               # 12
  - [[11, 12], 1, Concat, [1]]              # 13
  - [13, 3, C3, [128, False]]               # 14 (P3_out, 80x80)

  # 自顶向下再回落到 P4
  - [14, 1, Conv, [128, 3, 2]]              # 15
  - [[15, 10], 1, Concat, [1]]              # 16
  - [16, 3, C3, [256, False]]               # 17 (P4_out, 40x40)

  # 回落到 P5
  - [17, 1, Conv, [256, 3, 2]]              # 18
  - [[18, 4], 1, Concat, [1]]               # 19
  - [19, 3, C3, [256, False]]               # 20 (P5_out, 20x20)

  # Detect
  - [[14, 17, 20], 1, Detect, [nc, anchors]]# 21
